webservice/src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
	<soapenv:Header/>
	<soapenv:Body>
		<gs:getBookRequest>
			<gs:id>54</gs:id>
		</gs:getBookRequest>
	</soapenv:Body>
</soapenv:Envelope>